In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ayush\appdata\local\programs\python\python311\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\ayush\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ayush\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ayush\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ayush\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ayush\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
a=[[1,2,3],[4,5,6],[7,8,9]]

In [5]:
np.array(a)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [6]:
pd.DataFrame(a)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
df = pd.DataFrame([{"Maths" : 1, "Science" : 2},{"Maths" : 3, "Science" : 4}])

In [8]:
df

   Maths  Science
0      1        2
1      3        4

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df["Maths"])

pandas.core.series.Series

In [11]:
df["Maths"]

0    1
1    3
Name: Maths, dtype: int64

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Maths    2 non-null      int64
 1   Science  2 non-null      int64
dtypes: int64(2)
memory usage: 164.0 bytes

In [15]:
df.head(2)

   Maths  Science
0      1        2
1      3        4

In [22]:
df = pd.DataFrame([{"Maths" : 1, "Science" : 2},{"Maths" : 3, "Science" : 4}]*50)

In [23]:
df

    Maths  Science
0       1        2
1       3        4
2       1        2
3       3        4
4       1        2
..    ...      ...
95      3        4
96      1        2
97      3        4
98      1        2
99      3        4

[100 rows x 2 columns]

In [24]:
df.head()

   Maths  Science
0      1        2
1      3        4
2      1        2
3      3        4
4      1        2

In [25]:
df.head(2)

   Maths  Science
0      1        2
1      3        4

In [27]:
df.tail()

    Maths  Science
95      3        4
96      1        2
97      3        4
98      1        2
99      3        4

In [28]:
df.tail(3)

    Maths  Science
97      3        4
98      1        2
99      3        4

In [29]:
df.head(10)

   Maths  Science
0      1        2
1      3        4
2      1        2
3      3        4
4      1        2
5      3        4
6      1        2
7      3        4
8      1        2
9      3        4